class SubItem < ApplicationRecord
  mount_uploader :image, ImageUploader

  belongs_to :category, optional: true
  belongs_to :food, optional: true
  has_and_belongs_to_many :gyms, join_table: :gyms_sub_items
  has_many :points, dependent: :nullify

  enum sub_item_type: %i(normal food)
  # accepts_nested_attributes_for :gyms

  def self.generate_normal_subitem_food
    sub_item_info = [
      ["닭가슴살 큐브(오리지널)", 216, "normal"],
      ["꿀고구마(130g)", 169, "normal"],
      ["프로틴에이드", 70, "normal"],
      ["닭가슴살 소시지(오리지널)", 165, "normal"],
      ["퍼펙트 파워쉐이크(컵)", 150, "normal"],
      ["스마트웨이퍼크런치", 198, "normal"],
      ["갈비맛 닭가슴살팩(100g)", 216, "normal"],
      ["꿀단호박(100g)", 57, "normal"],
      ["스마트프로틴칩(파프리카)", 95, "normal"],
      ["단백한 쿠키(초코맛)", 294, "normal"],
      ["다밀밸런스", 120, "normal"]
    ]
    sub_item_info.each do |title, calorie, sub_item_type|
      SubItem.create(title: title, calorie: calorie, sub_item_type: sub_item_type)
    end
  end

  def self.generate_food_sub_items
    sub_item_info = [[["닭가슴살 큐브(오리지널)", 216, 3, 24, 12, 2400], ["꿀고구마(130g)", 169, 40.7, 2, 0, 1900], ["프로틴에이드", 70, 2, 15, 0, 1560]],
                      [["닭가슴살 소시지(오리지널)", 165, 9.5, 11, 9, 2400], ["꿀단호박(100g)", 57, 13.6, 1.2, 0.7, 1900], ["퍼펙트 파워쉐이크(컵)", 150, 21, 13, 1.8, 1500], ["스마트웨이퍼크런치", 198, 12, 8, 14, 1000]],
                      [["슬림시즌", 100, 27, 0, 0, 2200], ["꿀고구마(130g)", 169, 40.7, 2, 0, 1900], ["갈비맛 닭가슴살팩(100g)", 216, 3, 24, 12, 1500], ["스마트웨이퍼크런치", 198, 12, 8, 14, 1000]],
                      [["닭가슴살 큐브(오리지널)", 216, 3, 24, 12, 2400], ["꿀고구마(130g)", 169, 40.7, 2, 0, 1900], ["프로틴에이드", 70, 2, 15, 0, 1560], ["스마트웨이퍼크런치", 198, 12, 8, 14, 1000], ["닭가슴살 소시지(오리지널)", 165, 9.5, 11, 9, 2400], ["꿀단호박(100g)", 57, 13.6, 1.2, 0.7, 1900], ["퍼펙트 파워쉐이크(컵)", 150, 21, 13, 1.8, 1500]],
                      [["닭가슴살 소시지(오리지널)", 165, 9.5, 11, 9, 2400], ["꿀단호박(100g)", 57, 13.6, 1.2, 0.7, 1900], ["퍼펙트 파워쉐이크(컵)", 150, 21, 13, 1.8, 1500], ["스마트웨이퍼크런치", 198, 12, 8, 14, 1000], ["스마트프로틴칩(파프리카)", 95, 9.9, 6.8, 2.6, 1800], ["슬림시즌", 100, 27, 0, 0, 2200], ["꿀고구마(130g)", 169, 40.7, 2, 0, 1900], ["갈비맛 닭가슴살팩(100g)", 216, 3, 24, 12, 1500], ["다밀밸런스", 120, 13, 10, 4, 1200]],
                      [["슬림시즌", 100, 27, 0, 0, 2200], ["꿀고구마(130g)", 169, 40.7, 2, 0, 1900], ["갈비맛 닭가슴살팩(100g)", 216, 3, 24, 12, 1500], ["스마트웨이퍼크런치", 198, 12, 8, 14, 1000], ["스마트프로틴칩(파프리카)", 95, 9.9, 6.8, 2.6, 1800], ["닭가슴살 큐브(오리지널)", 216, 3, 24, 12, 2400], ["꿀고구마(130g)", 169, 40.7, 2, 0, 1900], ["프로틴에이드", 70, 2, 15, 0, 1560], ["로우칼로리바", 206, 24, 15, 6.8, 930]],
                      [["닭가슴살 큐브(오리지널)", 216, 3, 24, 12, 2400], ["꿀고구마(130g)", 169, 40.7, 2, 0, 1900], ["프로틴에이드", 70, 2, 15, 0, 1560], ["스마트웨이퍼크런치", 198, 12, 8, 14, 1000], ["닭가슴살 소시지(오리지널)", 165, 9.5, 11, 9, 2400], ["꿀단호박(100g)", 57, 13.6, 1.2, 0.7, 1900], ["퍼펙트 파워쉐이크(컵)", 150, 21, 13, 1.8, 1500], ["슬림시즌", 100, 27, 0, 0, 2200], ["꿀고구마(130g)", 169, 40.7, 2, 0, 1900], ["갈비맛 닭가슴살팩(100g)", 216, 3, 24, 12, 1500]],
                      [["닭가슴살 소시지(오리지널)", 165, 9.5, 11, 9, 2400], ["꿀단호박(100g)", 57, 13.6, 1.2, 0.7, 1900], ["퍼펙트 파워쉐이크(컵)", 150, 21, 13, 1.8, 1500], ["스마트웨이퍼크런치", 198, 12, 8, 14, 1000], ["스마트프로틴칩(파프리카)", 95, 9.9, 6.8, 2.6, 1800], ["슬림시즌", 100, 27, 0, 0, 2200], ["꿀고구마(130g)", 169, 40.7, 2, 0, 1900], ["갈비맛 닭가슴살팩(100g)", 216, 3, 24, 12, 1500], ["다밀밸런스", 120, 13, 10, 4, 1200], ["닭가슴살 큐브(오리지널)", 216, 3, 24, 12, 2400], ["꿀고구마(130g)", 169, 40.7, 2, 0, 1900], ["프로틴에이드", 70, 2, 15, 0, 1560]],
                      [["슬림시즌", 100, 27, 0, 0, 2200], ["꿀고구마(130g)", 169, 40.7, 2, 0, 1900], ["갈비맛 닭가슴살팩(100g)", 216, 3, 24, 12, 1500], ["스마트웨이퍼크런치", 198, 12, 8, 14, 1000], ["스마트프로틴칩(파프리카)", 95, 9.9, 6.8, 2.6, 1800], ["닭가슴살 큐브(오리지널)", 216, 3, 24, 12, 2400], ["꿀고구마(130g)", 169, 40.7, 2, 0, 1900], ["프로틴에이드", 70, 2, 15, 0, 1560], ["로우칼로리바", 206, 24, 15, 6.8, 930], ["닭가슴살 소시지(오리지널)", 165, 9.5, 11, 9, 2400], ["꿀단호박(100g)", 57, 13.6, 1.2, 0.7, 1900], ["퍼펙트 파워쉐이크(컵)", 150, 21, 13, 1.8, 1500], ["다밀밸런스", 120, 13, 10, 4, 1200]],
                      [["닭가슴살 큐브(오리지널)", 216, 3, 24, 12, 2400], ["꿀고구마(130g)", 169, 40.7, 2, 0, 1900], ["프로틴에이드", 70, 2, 15, 0, 1560], ["스마트웨이퍼크런치", 198, 12, 8, 14, 1000], ["닭가슴살 소시지(오리지널)", 165, 9.5, 11, 9, 2400], ["꿀단호박(100g)", 57, 13.6, 1.2, 0.7, 1900], ["퍼펙트 파워쉐이크(컵)", 150, 21, 13, 1.8, 1500], ["슬림시즌", 100, 27, 0, 0, 2200], ["꿀고구마(130g)", 169, 40.7, 2, 0, 1900], ["갈비맛 닭가슴살팩(100g)", 216, 3, 24, 12, 1500], ["단백한 쿠키(초코맛)", 294, 33, 9, 14, 2500], ["아침란(2구)", 150, 0.8, 11, 6.6, 1600]],
                      [["닭가슴살 소시지(오리지널)", 165, 9.5, 11, 9, 2400], ["꿀단호박(100g)", 57, 13.6, 1.2, 0.7, 1900], ["퍼펙트 파워쉐이크(컵)", 150, 21, 13, 1.8, 1500], ["스마트웨이퍼크런치", 198, 12, 8, 14, 1000], ["스마트프로틴칩(파프리카)", 95, 9.9, 6.8, 2.6, 1800], ["슬림시즌", 100, 27, 0, 0, 2200], ["꿀고구마(130g)", 169, 40.7, 2, 0, 1900], ["갈비맛 닭가슴살팩(100g)", 216, 3, 24, 12, 1500], ["다밀밸런스", 120, 13, 10, 4, 1200], ["닭가슴살 큐브(오리지널)", 216, 3, 24, 12, 2400], ["꿀고구마(130g)", 169, 40.7, 2, 0, 1900], ["프로틴에이드", 70, 2, 15, 0, 1560], ["단백한 쿠키(초코맛)", 294, 33, 9, 14, 2500], ["아침란(2구)", 150, 0.8, 11, 6.6, 1600]],
                      [["슬림시즌", 100, 27, 0, 0, 2200], ["꿀고구마(130g)", 169, 40.7, 2, 0, 1900], ["갈비맛 닭가슴살팩(100g)", 216, 3, 24, 12, 1500], ["스마트웨이퍼크런치", 198, 12, 8, 14, 1000], ["스마트프로틴칩(파프리카)", 95, 9.9, 6.8, 2.6, 1800], ["닭가슴살 큐브(오리지널)", 216, 3, 24, 12, 2400], ["꿀고구마(130g)", 169, 40.7, 2, 0, 1900], ["프로틴에이드", 70, 2, 15, 0, 1560], ["로우칼로리바", 206, 24, 15, 6.8, 930], ["닭가슴살 소시지(오리지널)", 165, 9.5, 11, 9, 2400], ["꿀단호박(100g)", 57, 13.6, 1.2, 0.7, 1900], ["퍼펙트 파워쉐이크(컵)", 150, 21, 13, 1.8, 1500], ["다밀밸런스", 120, 13, 10, 4, 1200], ["단백한 쿠키(초코맛)", 294, 33, 9, 14, 2500], ["아침란(2구)", 150, 0.8, 11, 6.6, 1600]]]

    [{title: "500~1000kcal(A)", food_type: :a, kcal: 455, carbo: 46, protein: 41, fat: 12, price: 5900},
      {title: "500~1000kcal(B)", food_type: :a, kcal: 570, carbo: 56, protein: 33, fat: 26, price: 6800},
      {title: "500~1000kcal(C)", food_type: :a, kcal: 683, carbo: 83, protein: 34, fat: 26, price: 6600},

      {title: "1000~1500kcal(A)", food_type: :b, kcal: 1025, carbo: 101.8, protein: 74.2, fat: 37.5, price: 12500},
      {title: "1000~1500kcal(B)", food_type: :b, kcal: 1270, carbo: 149.7, protein: 76, fat: 44.1, price: 15400},
      {title: "1000~1500kcal(C)", food_type: :b, kcal: 1439, carbo: 162.3, protein: 96.8, fat: 47.4, price: 14400},

      {title: "1500~2000kcal(A)", food_type: :c, kcal: 1510, carbo: 172.5, protein: 100.2, fat: 49.5, price: 17600},
      {title: "1500~2000kcal(B)", food_type: :c, kcal: 1725, carbo: 195.4, protein: 117, fat: 56.1, price: 21260},
      {title: "1500~2000kcal(C)", food_type: :c, kcal: 1931, carbo: 219.4, protein: 132, fat: 62.9, price: 20300},

      {title: "2000+(A)", food_type: :d, kcal: 1954, carbo: 206.3, protein: 120.2, fat: 70.1, price: 21700},
      {title: "2000+(B)", food_type: :d, kcal: 2169, carbo: 229.2, protein: 137, fat: 76.7, price: 25360},
      {title: "2000+(C)", food_type: :d, kcal: 2375, carbo: 253.2, protein: 152, fat: 83.5, price: 24400}].each_with_index do |food_info, index|
      food = Food.create food_info
      sub_item_info[index].each do |title, calorie, carbo, protein, fat, price|
        food.sub_items << SubItem.find_or_create_by(title: title, calorie: calorie, carbo: carbo, protein: protein, fat: fat, price: price, sub_item_type: :normal)
      end
    end
  end
end
